perf/tests/breakpoint-put-rates-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:

    - name: Ramp - Breakpoint
      duration: 240      # 4 minutos
      arrivalRate: 5
      rampTo: 1000


scenarios:

  - name: Rates PUT (/rates)
    weight: 1
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            rate: 0.85