perf/tests/endurance-test.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:

    - name: Ramp-up
      duration: 60        
      arrivalRate: 5    
      rampTo: 150         

    - name: Endurance
      duration: 5400  # 1.5 horas
      arrivalRate: 150 # carga sostenida de 150 rps

    - name: Ramp-down
      duration: 60
      arrivalRate: 150
      rampTo: 5  

scenarios:

  - name: Exchange transaction
    weight: 5
    flow:
      - post:
          url: "/exchange"
          json:
            baseCurrency: "USD"
            counterCurrency: "ARS"
            baseAmount: 1.0
            baseAccountId: 2
            counterAccountId: 1

  - name: Rates PUT (/rates)
    weight: 2             # ponderación
    flow:
      - put:
          url: '/rates'
          json:
            baseCurrency: "USD"
            counterCurrency: "EUR"
            rate: 0.85

  - name: Get Rates (/rates)
    weight: 3
    flow:
      - get:
          url: '/rates'