perf/tests/exchange-volume3.yaml
config:
  environments:
    api:
      target: 'http://localhost:5555'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-api"

  pool: 50

  phases:
    - name: Ramp
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: Plain
      duration: 60
      arrivalRate: 5

scenarios:
  - name: Exchange ARS/USD and EUR/ARS
    flow:
      # ARS -> USD (distintos montos)
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 1500
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 5000
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 12345

      # EUR -> ARS (distintos montos)
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 10
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 25
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 50

      # Alternadas adicionales
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 750
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 15
      - post:
          url: '/exchange'
          json:
            baseCurrency: "ARS"
            counterCurrency: "USD"
            baseAccountId: 1
            counterAccountId: 2
            baseAmount: 3000
      - post:
          url: '/exchange'
          json:
            baseCurrency: "EUR"
            counterCurrency: "ARS"
            baseAccountId: 3
            counterAccountId: 1
            baseAmount: 30